{
    "birth_number": {
      "1": "You are a natural-born leader, ambitious, confident, and highly independent.",
      "2": "You are a peacemaker, highly sensitive, cooperative, and intuitive.",
      "3": "You are creative, expressive, optimistic, and full of charm.",
      "4": "You are practical, hardworking, disciplined, and reliable.",
      "5": "You are adventurous, freedom-loving, dynamic, and adaptable.",
      "6": "You are nurturing, responsible, compassionate, and family-oriented.",
      "7": "You are introspective, spiritual, analytical, and a seeker of truth.",
      "8": "You are ambitious, goal-driven, materialistic, and a natural entrepreneur.",
      "9": "You are compassionate, humanitarian, idealistic, and generous."
    },
    "destiny_number": {
      "1": "You are destined to lead, take initiative, and pave your own path.",
      "2": "Your destiny is to bring balance, harmony, and cooperation.",
      "3": "Your destiny lies in expressing yourself creatively and inspiring others.",
      "4": "Your destiny is to create stability, discipline, and solid foundations.",
      "5": "You are destined for a life of freedom, adventure, and adaptability.",
      "6": "Your destiny lies in nurturing and bringing people together.",
      "7": "You are destined for spiritual growth, wisdom, and truth-seeking.",
      "8": "You are destined for material success, leadership, and financial power.",
      "9": "Your destiny is to serve humanity with compassion and selflessness."
    },
    "combination": {
      "1-1": "A leader with double strength. Highly independent, but be cautious about arrogance.",
      "1-2": "Balance between ambition and harmony. You work well with others while leading.",
      "1-3": "A creative leader who uses charisma to inspire.",
      "1-4": "Strong discipline meets leadership. Practical and results-oriented.",
      "1-5": "A bold adventurer who leads dynamically.",
      "1-6": "A nurturing leader who values family and community.",
      "1-7": "Spiritual and analytical with strong leadership.",
      "1-8": "Material success combined with strong ambition.",
      "1-9": "Humanitarian leadership with compassion for others.",
      "2-1": "A sensitive individual who balances leadership with intuition.",
      "2-2": "Highly cooperative and empathetic, excelling in partnerships.",
      "2-3": "A peacemaker who communicates creatively and inspires others.",
      "2-4": "Practical and harmonious. Great at building stable relationships.",
      "2-5": "A flexible and dynamic partner with a strong emotional side.",
      "2-6": "Caring, nurturing, and cooperative. Strong family values.",
      "2-7": "Intuitive and spiritual, with a strong desire for balance.",
      "2-8": "Emotionally balanced, ambitious, and practical.",
      "2-9": "A humanitarian who excels at bringing people together.",
      "3-1": "A creative leader who inspires confidence in others.",
      "3-2": "Highly expressive and harmonious, bringing joy to partnerships.",
      "3-3": "Double creativity and charm. A natural performer or artist.",
      "3-4": "Creative energy balanced by discipline and practicality.",
      "3-5": "Adventurous and expressive, constantly seeking excitement.",
      "3-6": "Creative and nurturing. Strong focus on family and artistry.",
      "3-7": "Introspective and spiritual with a unique creative flair.",
      "3-8": "Ambitious and expressive, balancing material and artistic goals.",
      "3-9": "Creative and humanitarian, with a vision for the greater good.",
      "4-1": "A disciplined leader with strong foundations.",
      "4-2": "Practical and cooperative, great at building lasting partnerships.",
      "4-3": "Creative and disciplined, able to turn ideas into reality.",
      "4-4": "Double discipline. Hardworking and reliable, but avoid rigidity.",
      "4-5": "Practical and adventurous. Adapts well to changing circumstances.",
      "4-6": "Responsible and family-oriented, with a solid foundation.",
      "4-7": "Practical and introspective, balancing logic with spirituality.",
      "4-8": "Highly ambitious and disciplined, with great material success.",
      "4-9": "A humanitarian builder, creating a better future for others.",
      "5-1": "A bold leader who thrives on adventure and change.",
      "5-2": "Dynamic and cooperative, excelling in flexible partnerships.",
      "5-3": "Highly expressive and adventurous. A free spirit.",
      "5-4": "Adventurous yet practical, able to adapt and build.",
      "5-5": "Double freedom and change. A true explorer of life.",
      "5-6": "Dynamic and nurturing. Strong focus on family and flexibility.",
      "5-7": "Adventurous and spiritual, seeking meaning in freedom.",
      "5-8": "Dynamic and ambitious, balancing adventure with material success.",
      "5-9": "Adventurous and humanitarian, working for the greater good.",
      "6-1": "A nurturing leader with a strong sense of responsibility.",
      "6-2": "Caring and cooperative, creating harmony in partnerships.",
      "6-3": "Creative and family-oriented, inspiring through nurturing energy.",
      "6-4": "Responsible and practical, creating solid foundations for family.",
      "6-5": "Dynamic and nurturing, with a strong focus on relationships.",
      "6-6": "Double care and responsibility. A true family nurturer.",
      "6-7": "Caring and spiritual, with a deep connection to others.",
      "6-8": "Responsible and ambitious, balancing family and success.",
      "6-9": "Compassionate and nurturing, serving humanity selflessly.",
      "7-1": "A spiritual leader with analytical abilities.",
      "7-2": "Highly intuitive and cooperative, with deep insights.",
      "7-3": "Spiritual and creative, using introspection to inspire.",
      "7-4": "Practical and introspective, balancing logic and spirituality.",
      "7-5": "Adventurous and spiritual, constantly seeking knowledge.",
      "7-6": "Nurturing and introspective, with a deep understanding of others.",
      "7-7": "Double spirituality and introspection. A seeker of deep truths.",
      "7-8": "Analytical and ambitious, balancing material and spiritual goals.",
      "7-9": "Spiritual and humanitarian, working for the greater good.",
      "8-1": "A leader with strong ambition and material success.",
      "8-2": "Ambitious and cooperative, excelling in partnerships.",
      "8-3": "Creative and ambitious, balancing artistry with success.",
      "8-4": "Highly disciplined and ambitious, achieving great results.",
      "8-5": "Dynamic and ambitious, thriving on change and success.",
      "8-6": "Responsible and ambitious, balancing family and material goals.",
      "8-7": "Ambitious and introspective, seeking deeper meaning.",
      "8-8": "Double ambition and material success. A natural entrepreneur.",
      "8-9": "Ambitious and humanitarian, working for both personal and societal success.",
      "9-1": "A compassionate leader with a vision for the greater good.",
      "9-2": "Humanitarian and cooperative, excelling in bringing people together.",
      "9-3": "Creative and humanitarian, with a focus on serving others.",
      "9-4": "Practical and compassionate, building a better world for others.",
      "9-5": "Adventurous and humanitarian, with a love for freedom.",
      "9-6": "Nurturing and compassionate, deeply connected to humanity.",
      "9-7": "Spiritual and humanitarian, working for global harmony.",
      "9-8": "Ambitious and compassionate, balancing success with service.",
      "9-9": "Double humanitarian energy. A true visionary for humanity."
    },
    "challenges": {
      "1": "Avoid arrogance and listen to others' ideas.",
      "2": "Don't overthink or let indecisiveness stop you.",
      "3": "Focus your creativity; avoid being scattered.",
      "4": "Learn to be flexible and open to change.",
      "5": "Manage freedom wisely; avoid impulsiveness.",
      "6": "Don't let responsibility overwhelm you.",
      "7": "Stay grounded; avoid isolation.",
      "8": "Balance ambition with emotional needs.",
      "9": "Set boundaries to prevent burnout."
    }
  }
  